{
  "Battle.Start": "%1 started a fight!",
  "Battle.Fight": "Fight",
  "Battle.Escape": "Escape",
  "Battle.Attack": "Attack",
  "Battle.Guard": "Guard",
  "Battle.PreEmp": "%1 striked first!",
  "Battle.Suprise": "%1 was suprised!",
  "Battle.EscapeTry": "%1 has started to escape!",
  "Battle.EscapeFail": "However, they failed to escape!",
  "Battle.Victory": "%1 won!",
  "Battle.Lose": "%1 lost...",
  "Battle.Exp": "Received %1 Experience!",
  "Battle.Gold": "Received %1\\G!",
  "Battle.Item": "Received %1!",
  "Battle.LevelUp": "%1 is now %2 %3!",
  "Battle.NewSkill": "Learned %1!",
  "Battle.AutoStop": "Press anything to stop Auto Battle.",
  "Battle.FightHelp": "Select actions to fight.",
  "Battle.AutoHelp": "Sets party to Auto Battle mode.",
  "Battle.OptionsHelp": "Opens the Options menu.",
  "Battle.EscapeHelp": "Attempt to escape the battle.",
  "Battle.SkillHelp": "Opens a list of skills under the \\C[16]%1\\C[0] category.",
  "Battle.ItemHelp": "Opens a list of items that you can use.",
  "Battle.AutoHelp2": "Automatically choose an action suitable for combat.",
  "Battle.Miss": "Miss",
  "Battle.Delay": "Delay!",
  "Battle.Rush": "Rush!",

  "Ability.Skill": "Skill",
  "Ability.Ultimate": "Ultimate",
  "Ability.FUA": "Follow-Up Attack",

  "State.Death": "Fainted",
  "State.Death.Desc": "Prevents from doing anything until revived.",
  "State.Debuff.Physical": "Wounded",
  "State.Debuff.Physical.Desc": "Reduces Defence and Magical Defence by 5%.",
  "State.Debuff.Fire": "Singed",
  "State.Debuff.Fire.Desc": "Reduces maximum HP by 5%",
  "State.Debuff.Ice": "Frost",
  "State.Debuff.Ice.Desc": "Reduces Agility by 5%.",
  "State.Debuff.Electricity": "Electrified",
  "State.Debuff.Electricity.Desc": "Increases DoT taken by 10%.",
  "State.Debuff.Water": "Wet",
  "State.Debuff.Water.Desc": "Reduces Luck by 10%.",
  "State.Debuff.Earth": "Mild Petrification",
  "State.Debuff.Earth.Desc": "Reduces Evasion and Magical Evasion by 15%.",
  "State.Debuff.Wind": "Mighty Wind",
  "State.Debuff.Wind.Desc": "Reduces Accuracy and Crit Chance by 15%.",
  "State.Debuff.Star": "Starshred",
  "State.Debuff.Star.Desc": "Increases all non-DoT damage taken by 10%.",
  "State.Debuff.Void": "Voided Attack",
  "State.Debuff.Void.Desc": "Reduces Attack and Magical Attack by 5%.",
  "State.Debuff.Nature": "Withered",
  "State.Debuff.Nature.Desc": "Reduces all damage dealt by 10%.",
  "State.Debuff.Elementless": "Weakness",
  "State.Debuff.Elementless.Desc": "Reduces all main stats by 2.5%.",
  "State.DoT.Physical": "Bleed",
  "State.DoT.Physical.Desc": "Deals Physical damage every turn, reduces Defence and Magical Defence by 7.5%.",
  "State.DoT.Fire": "Burn",
  "State.DoT.Fire.Desc": "Deals Fire damage every turn, reduces maximum HP by 10%.",
  "State.DoT.Ice": "Frostbite",
  "State.DoT.Ice.Desc": "Deals Ice damage every turn, and reduces Agility by 10%.",
  "State.DoT.Electricity": "Shock",
  "State.DoT.Electricity.Desc": "Deals Electrical damage every turn, and increases DoT taken by 5%.",
  "State.DoT.Water": "Erosion",
  "State.DoT.Water.Desc": "Deals Water damage every turn, and reduces Luck by 15%.",
  "State.DoT.Earth": "Quake",
  "State.DoT.Earth.Desc": "Deals Earth damage every turn (ignoring 20% of DEM/MDF), and reduces Evasion and Magical Evasion by 5%.",
  "State.DoT.Wind": "Wind Shear",
  "State.DoT.Wind.Desc": "Deals Wind damage every turn (having 25% higher ATK/DEF scaling), and reduces Accuracy and Crit Rate by 5%.",
  "State.DoT.Star": "Starburn",
  "State.DoT.Star.Desc": "Deals Star damage every turn, and increases non-DoT damage taken by 15%.",
  "State.DoT.Void": "Fadeaway",
  "State.DoT.Void.Desc": "Deals Void damage every turn, alongside reducing Attack and Magical Attack by 7.5%.",
  "State.DoT.Nature": "Venom",
  "State.DoT.Nature.Desc": "Deals Natural damage every turn, an decreases damage dealt by 15%.",
  "State.DoT.Elementless": "Poison",
  "State.DoT.Elementless.Desc": "Reduces HP Regen by 0.5%.",
  "State.CC.Physical": "Broken",
  "State.CC.Physical.Desc": "Reduces Defence and Magical Defence by 10% and prevents from taking action. Strongly Delays upon being applied.",
  "State.CC.Fire": "Inferno",
  "State.CC.Fire.Desc": "Deals Fire damage every turn, reduces Max HP by 20%, and prevents from taking action. Turns into Singed upon expire.",
  "State.CC.Ice": "Freeze",
  "State.CC.Ice.Desc": "Increases damage taken by 50%, reduces Agility by 20%, and prevents from taking action. Breaks upon being attacked, and turns into Frost upon expire.",
  "State.CC.Electricity": "Paralysis",
  "State.CC.Electricity.Desc": "Increases DoT damage taken by 25% and prevents from taking action.",
  "State.CC.Water": "Riptide",
  "State.CC.Water.Desc": "Reduces Luck by 25% and prevents from taking action.",
  "State.CC.Earth": "Petrification",
  "State.CC.Earth.Desc": "Prevents from taking action. Has a chance of being prolonged every turn.",
  "State.CC.Wind": "Blow Away",
  "State.CC.Wind.Desc": "Prevents from taking action and has a chance of Insta-Killing every turn.",
  "State.CC.Star": "Radiated",
  "State.CC.Star.Desc": "Deals 110% Star DoT and prevents from taking action. Turns into Weakness upon expire.",
  "State.CC.Void": "Imprisoned",
  "State.CC.Void.Desc": "Reduces Agility by 90%, increases all damage taken by 10%, and prevents from taking action.",
  "State.CC.Nature": "Entangled",
  "State.CC.Nature.Desc": "Deals Natural damage every turn and prevents from taking action. Turns into Poison upon expire.",
  "State.CC.Elementless": "Sleep",
  "State.CC.Elementless.Desc": "Increases HP and MP Regen by 2.5%, but prevents from taking action.",
  "State.PCC.Berserk": "Berserk",
  "State.PCC.Berserk.Desc": "Forces to attack enemies with Basic Attack. Increases ATK, MAT, AGI, and LUK by 20%.",
  "State.PCC.Violent": "Violent Outburst",
  "State.PCC.Violent.Desc": "Forces to attack enemies with Basic Attack.",
  "State.PCC.Confused": "Confused",
  "State.PCC.Confused.Desc": "Forces to attack random units with Basic Attack.",
  "State.PCC.Corruption": "Memetic Corruption",
  "State.PCC.Corruption.Desc": "Forces to attack random units with Basic Attack. Very hard to dispel.",
  "State.PCC.Dominated": "Dominated",
  "State.PCC.Dominated.Desc": "Forces to attack allies with Basic Attack. Increases DoT damage taken by 10%.",
  "State.PCC.Blessing": "Melting Blessing",
  "State.PCC.Blessing.Desc": "Increases Mana Regen by 2.5%...",
  "State.PCC.Anomalous": "Anomalous Takeover",
  "State.PCC.Anomalous.Desc": "Forces to attack allies with Basic Attack. Can spread Melting Blessing. Turns into Melting Blessing upon dispelling. Is a lose condition.",
  "State.Mesmerized": "Mesmerized",
  "State.Mesmerized.Desc": "Increases AGI by 50.5. Turns into a random debuff upon expire.",
  "State.Stun": "Stunned",
  "State.Stun.Desc": "Prevents from taking action.",
  "State.Charge": "Charge",
  "State.Charge.Desc": "Charges up a powerful attack.",
  "State.Focus": "Focus",
  "State.Focus.Desc1": "Increases Crit Rate and Luck by 5%, and Evasion by 3%, and increases resistance to CCs and pseudo-CCs by 10%",
  "State.Focus.Desc2": "Increases Crit Rate and Luck by 7.5%, and Evasion by 6%, and increases resistance to CCs and pseudo-CCs by 20%",
  "State.Focus.Desc3": "Increases Crit Rate and Luck by 10%, and Evasion by 9%, and increases resistance to CCs and pseudo-CCs by 30%",
  "State.Focus.Desc4": "Increases Crit Rate and Luck by 12.5%, and Evasion by 12%, and increases resistance to CCs and pseudo-CCs by 40%",
  "State.ChakraStrengthen": "Chakra Strengthen",
  "State.ChakraStrengthen.Desc1": "Increases Crit Rate and Luck by 15%, and Evasion by 15%, and increases resistance to CCs and pseudo-CCs by 50%",
  "State.ChakraStrengthen.Desc2": "Increases Crit Rate and Luck by 17.5%, and Evasion by 18%, and increases resistance to CCs and pseudo-CCs by 60%",
  "State.ChakraOverload": "Chakra Overload",
  "State.ChakraOverload.Desc": "Increases Crit Rate and Luck by 20%, and Evasion by 21%, and increases resistance to CCs and pseudo-CCs by 70%",
  "State.NurikabeWall": "Nurikabe Wall",
  "State.NurikabeWall.Desc1": "Absorbs damage based on remaining shield. Reduces damage taken by 5%.",
  "State.NurikabeWall.Desc2": "Absorbs damage based on remaining shield. Reduces damage taken by 10%.",
  "State.NurikabeWall.Desc3": "Absorbs damage based on remaining shield. Reduces damage taken by 15%.",
  "State.NurikabeBarrier": "Nurikabe Barrier",
  "State.NurikabeBarrier.Desc": "Absorbs damage based on remaining shield. Reduces damage taken by 20%.",
  "State.NurikabeFortress": "Nurikabe Fortress",
  "State.NurikabeFortress.Desc": "Absorbs damage based on remaining shield. Reduces damage taken by 25% and increases damage dealt by 10%.",
  "State.Tag": "Tag",
  "State.Tag.Desc": "Deals self-damage equal to 125% of ATK after expiration.",
  "State.ExplosiveTag": "Explosive Tag",
  "State.ExplosiveTag.Desc": "Absorbs damage based on remaining shield. Reduces damage taken by 25% and increases damage dealt by 10%.",
  "State.Tag.Desc1": "Deals self-damage equal to 150% of ATK after expiration.",
  "State.Tag.Desc2": "Deals self-damage equal to 175% of ATK after expiration.",
  "State.Tag.Desc3": "Deals self-damage equal to 200% of ATK after expiration.",
  "State.Tag.Desc4": "Deals self-damage equal to 225% of ATK after expiration.",

  "Skill.Hana.ShurikenThrow.1": "Shuriken Throw",
  "Skill.Hana.ShurikenThrow.1.Desc": "Throws a shuriken at the enemies, dealing 150% Material Weapon-elemental damage to a random enemy.",
  "Skill.Hana.ShurikenThrow.2": "Shuriken Throw+",
  "Skill.Hana.ShurikenThrow.2.Desc": "Throws a shuriken at the enemies, dealing 175% Material Weapon-elemental damage to a random enemy.",
  "Skill.Hana.ShurikenThrow.3": "Double Shuriken",
  "Skill.Hana.ShurikenThrow.3.Desc": "Throws two shurikens at the enemies, dealing 100% Material Weapon-elemental damage to 2 random enemies.",
  "Skill.Hana.ShurikenThrow.4": "Double Shuriken+",
  "Skill.Hana.ShurikenThrow.4.Desc": "Throws two shurikens at the enemies, dealing 125% Material Weapon-elemental damage to 2 random enemies.",
  "Skill.Hana.ShurikenThrow.5": "Piercing Shuriken",
  "Skill.Hana.ShurikenThrow.5.Desc": "Throws two shurikens at the enemies, dealing 150% Material Weapon-elemental damage to 2 random enemies. Ignores 10% of enemy DEF.",
  "Skill.Hana.ShurikenThrow.6": "Piercing Shuriken+",
  "Skill.Hana.ShurikenThrow.6.Desc": "Throws two shurikens at the enemies, dealing 175% Material Weapon-elemental damage to 2 random enemies. Ignores 20% of enemy DEF.",
  "Skill.Hana.ShurikenThrow.7": "Shuriken Storm",
  "Skill.Hana.ShurikenThrow.7.Desc": "Throws five shurikens at the enemies, dealing 80% Material Weapon-elemental damage to 5 random enemies. Ignores 25% of enemy DEF.",
  "Skill.Hana.WindThrow.1": "Wind Throw",
  "Skill.Hana.WindThrow.1.Desc": "Throws a wind orb, dealing 200% Material Wind damage to a single enemy.",
  "Skill.Hana.WindThrow.2": "Wind Throw+",
  "Skill.Hana.WindThrow.2.Desc": "Throws a wind orb, dealing 250% Material Wind damage to a single enemy.",
  "Skill.Hana.WindThrow.3": "Wind Throw++",
  "Skill.Hana.WindThrow.3.Desc": "Throws a wind orb, dealing 300% Material Wind damage to a single enemy.",
  "Skill.Hana.WindThrow.4": "Wind Tear",
  "Skill.Hana.WindThrow.4.Desc": "Throws a wind orb, dealing 350% Material Wind damage to a single enemy, and has a 25% chance to reduce their DEF by 1 stage.",
  "Skill.Hana.WindThrow.5": "Wind Tear+",
  "Skill.Hana.WindThrow.5.Desc": "Throws a wind orb, dealing 400% Material Wind damage to a single enemy, and has a 50% chance to reduce their DEF by 1 stage.",
  "Skill.Hana.WindThrow.6": "Wind Tear++",
  "Skill.Hana.WindThrow.6.Desc": "Throws a wind orb, dealing 450% Material Wind damage to a single enemy, and has a 75% chance to reduce their DEF by 1 stage.",
  "Skill.Hana.WindThrow.7": "Wind Saw Shuriken",
  "Skill.Hana.WindThrow.7.Desc": "Throws a wind orb, dealing 500% Material Wind damage to a single enemy, reducing their DEF by 1 stage, and having a 20% chance to Stun them for 1 turn.",
  "Skill.Hana.KunaiSlash.1": "Kunai Slash",
  "Skill.Hana.KunaiSlash.1.Desc": "Deals 140% Material Physical damage to a single enemy. Has a 5% higher Crit Rate.",
  "Skill.Hana.KunaiSlash.2": "Double Kunai Slash",
  "Skill.Hana.KunaiSlash.2.Desc": "Deals 85% Material Physical damage to a single enemy, twice. Has a 10% higher Crit Rate.",
  "Skill.Hana.KunaiSlash.3": "Double Kunai Slash+",
  "Skill.Hana.KunaiSlash.3.Desc": "Deals 100% Material Physical damage to a single enemy, twice. Has a 15% higher Crit Rate.",
  "Skill.Hana.KunaiSlash.4": "Kunai Shuriken",
  "Skill.Hana.KunaiSlash.4.Desc": "Deals 57.5% Material Physical damage to a single enemy, 4 times. Has a 20% higher Crit Rate.",
  "Skill.Hana.KunaiSlash.5": "Kunai Shuriken+",
  "Skill.Hana.KunaiSlash.5.Desc": "Deals 65% Material Physical damage to a single enemy, 4 times. Has a 25% higher Crit Rate.",
  "Skill.Hana.KunaiSlash.6": "Kunai Shuriken++",
  "Skill.Hana.KunaiSlash.6.Desc": "Deals 72.5% Material Physical damage to a single enemy, 4 times. Has a 30% higher Crit Rate.",
  "Skill.Hana.KunaiSlash.7": "Kunai Whirlwind",
  "Skill.Hana.KunaiSlash.7.Desc": "Deals 65% Material Physical damage to a single enemy, 5 times. Has a 40% higher Crit Rate and 10% higher Crit Damage.",
  "Skill.Hana.Focus.1": "Focus",
  "Skill.Hana.Focus.1.Desc": "Increases Crit Rate and Luck of a single ally by 5%, and Evasion by 3%, and increases their resistance to CCs and pseudo-CCs by 10%, for 3 turns.",
  "Skill.Hana.Focus.2": "Focus+",
  "Skill.Hana.Focus.2.Desc": "Increases Crit Rate and Luck of a single ally by 7.5%, and Evasion by 6%, and increases their resistance to CCs and pseudo-CCs by 20%, for 3 turns.",
  "Skill.Hana.Focus.3": "Focus++",
  "Skill.Hana.Focus.3.Desc": "Increases Crit Rate and Luck of a single ally by 10%, and Evasion by 9%, and increases their resistance to CCs and pseudo-CCs by 30%, for 3 turns.",
  "Skill.Hana.Focus.4": "Focus+++",
  "Skill.Hana.Focus.4.Desc": "Increases Crit Rate and Luck of a single ally by 12.5%, and Evasion by 12%, and increases their resistance to CCs and pseudo-CCs by 40%, for 3 turns.",
  "Skill.Hana.Focus.5": "Chakra Strengthen",
  "Skill.Hana.Focus.5.Desc": "Increases Crit Rate and Luck of a single ally by 15%, and Evasion by 15%, and increases their resistance to CCs and pseudo-CCs by 50%, for 4 turns. Additionally increases ATK and MAT by 1 stage.",
  "Skill.Hana.Focus.6": "Chakra Strengthen+",
  "Skill.Hana.Focus.6.Desc": "Increases Crit Rate and Luck of a single ally by 17.5%, and Evasion by 18%, and increases their resistance to CCs and pseudo-CCs by 60%, for 4 turns. Additionally increases ATK and MAT by 1 stage.",
  "Skill.Hana.Focus.7": "Chakra Overload",
  "Skill.Hana.Focus.7.Desc": "Increases Crit Rate and Luck of a single ally by 20%, and Evasion by 21%, and increases their resistance to CCs and pseudo-CCs by 70%, for 5 turns. Additionally increases ATK, MAT, and LUK by 1 stage.",
  "Skill.Hana.NurikabeWall.1": "Nurikabe Wall",
  "Skill.Hana.NurikabeWall.1.Desc": "Grants a single ally a shield worth 200% of Hana's DEF, and makes them take 5% less damage for as long as the shield is up.",
  "Skill.Hana.NurikabeWall.2": "Nurikabe Wall+",
  "Skill.Hana.NurikabeWall.2.Desc": "Grants a single ally a shield worth 225% of Hana's DEF, and makes them take 10% less damage for as long as the shield is up.",
  "Skill.Hana.NurikabeWall.3": "Nurikabe Wall++",
  "Skill.Hana.NurikabeWall.3.Desc": "Grants a single ally a shield worth 250% of Hana's DEF, and makes them take 15% less damage for as long as the shield is up.",
  "Skill.Hana.NurikabeWall.4": "Nurikabe Barrier",
  "Skill.Hana.NurikabeWall.4.Desc": "Grants a single ally a shield worth 275% of Hana's DEF and 50% of Hana's MDF, and makes them take 20% less damage for as long as the shield is up.",
  "Skill.Hana.NurikabeWall.5": "Nurikabe Fortress",
  "Skill.Hana.NurikabeWall.5.Desc": "Grants a single ally a shield worth 300% of Hana's DEF and 100% of Hana's MDF, and makes them take 25% less damage and deal 10% more damage for as long as the shield is up.",
  "Skill.Hana.BambooGrow.1": "Bamboo Grow",
  "Skill.Hana.BambooGrow.1.Desc": "Deals 100% Material Natural damage 2 times to a single enemy, with 2 additional 20% chances for additional hits.",
  "Skill.Hana.BambooGrow.2": "Bamboo Grow+",
  "Skill.Hana.BambooGrow.2.Desc": "Deals 125% Material Natural damage 2 times to a single enemy, with 2 additional 25% chances for additional hits.",
  "Skill.Hana.BambooGrow.3": "Bamboo Stinger",
  "Skill.Hana.BambooGrow.3.Desc": "Deals 100% Material Natural damage 3 times to a single enemy, with 3 additional 30% chances for additional hits. Each hit has a 10% chance of applying Poison.",
  "Skill.Hana.BambooGrow.4": "Bamboo Stinger+",
  "Skill.Hana.BambooGrow.4.Desc": "Deals 125% Material Natural damage 3 times to a single enemy, with 3 additional 35% chances for additional hits. Each hit has a 20% chance of applying Poison.",
  "Skill.Hana.BambooGrow.5": "Eternal Bamboo Slash",
  "Skill.Hana.BambooGrow.5.Desc": "Deals 100% Material Natural damage 4 times to a single enemy, with 4 additional 40% chances for additional hits. Each hit has a 30% chance of applying Poison, and a 10% chance of Delaying the enemy for 1 Action.",
  "Skill.Hana.Tag.1": "Tag",
  "Skill.Hana.Tag.1.Desc": "Applies a paper bomb to enemy, which will explode after 3 turns, dealing 125% Physical damage to them, scaled off their own ATK.",
  "Skill.Hana.Tag.2": "Explosive Tag",
  "Skill.Hana.Tag.2.Desc": "Applies a paper bomb to enemy, which will explode after 3 turns, dealing 150% Fire damage to them, scaled off their own ATK.",
  "Skill.Hana.Tag.3": "Explosive Tag Bomb",
  "Skill.Hana.Tag.3.Desc": "Deals 100% Fire damage and applies a paper bomb to enemy, which will explode after 3 turns, dealing 175% Fire damage to them, scaled off their own ATK.",
  "Skill.Hana.Tag.4": "Quick Explosive Tag Bomb",
  "Skill.Hana.Tag.4.Desc": "Deals 150% Fire damage and applies a paper bomb to enemy, which will explode after 2 turns, dealing 200% Fire damage to them, scaled off their own ATK.",
  "Skill.Hana.Tag.5": "Explosive Tag Nuke",
  "Skill.Hana.Tag.5.Desc": "Deals 200% Fire damage to one enemy and applies a paper bomb to all enemies, which will explode after 2 turns, dealing 225% Fire damage to them, scaled off their own ATK.",
  "Skill.Hana.Tag.Explode": "Explosion",

  "Ult.Ember": "Heat Overload",
  "Ult.Ember.Desc": "Increases Body temperature by 10°, dealing high Fire damage to all enemies, while also applying Burn, Inferno, and a delay on them. <br>\"Now it's time for you to try how pure inferno feels like!\"",

  "Enemy.KillerBot.Knight": "KillerBot Knight",
  "Enemy.KillerBot.Knight.Desc": "An ordinary KillerBot that uses a blade. They're great at single-target attacks, and solely uses Material damage.",
  "Enemy.KillerBot.Mage": "KillerBot Mage",
  "Enemy.KillerBot.Mage.Desc": "An ordinary KillerBot that uses a wand. They have a lot of AoE Magical attacks and can buff other KillerBots as well.",
  "Enemy.KillerBot.Gunner": "KillerBot Gunner",
  "Enemy.KillerBot.Gunner.Desc": "An ordinary KillerBot that uses a gun. They're slow, but can deal a lot of Magical damage - especially if they Charge their Hyper Beam.",
  "Enemy.KillerBot.Archer": "KillerBot Archer",
  "Enemy.KillerBot.Archer.Desc": "An ordinary KillerBot that uses a bow. They can apply a lot of elemental debuffs, and are good at Material attacks.",
  "Enemy.KillerBot.Feline": "KillerBot Feline",
  "Enemy.KillerBot.Feline.Desc": "An ordinary KillerBot that uses a small blade and shield. They're clearly based on a catfolk, and they are fast and a total wildcard.",
  "Enemy.KillerBot.Psychic": "KillerBot Psychic",
  "Enemy.KillerBot.Psychic.Desc": "One of the most deadly KillerBots. It can utilise True Physical damage, and has even a chance to insta-kill you. Kill it without mercy.",
  "Enemy.KillerBot.Princess": "KillerBot Princess",
  "Enemy.KillerBot.Princess.Desc": "A corrupted rendition of an infamous mascot. It is normally passive, but can crash out when damaged and go into a frenzy. Also applies a weak Star-elemental DoT, even when passive.",
  "Enemy.KillerBot.Psycho": "KillerBot Psycho",
  "Enemy.KillerBot.Psycho.Desc": "These KillerBots are infamous even among KillerBots. They'll flood you with DoTs, and when they get bored they'll just kill you.",
  "Enemy.KillerBot.Stargazer": "KillerBot Stargazer",
  "Enemy.KillerBot.Stargazer.Desc": "A KillerBot design inspired by classic alien media. Largely uses Star-elemental attacks, though can handle Fire, Ice, and Electricity as well.",
  "Enemy.Core.Thunder": "Thunder Core",
  "Enemy.Core.Thunder.Desc": "The manifestation of Kastellia Temple's worship of the God of Rhythm. Try to get into its groove and learn its pattern, while avoiding its Electrical attacks.",
  "Enemy.Core.Miracle": "Miracle Core",
  "Enemy.Core.Miracle.Desc": "The rogue elemental energies manifested into this thing. It can change the element on a whim, and additionally is extremely resistant to anything but the element it is currently using and its opposite!",
  "Enemy.Chimera.DrRoboNuts": "Dr. RoboNuts",
  "Enemy.Chimera.DrRoboNuts.Desc": "This is the madman behind the Chimeras. Even in his attacks, he comes off as completely off the rails. Especially his SUPER LASER NUKE. Be careful.",
  "Enemy.Office.Copyright": "Copyright Office Worker",
  "Enemy.Office.Copyright.Desc": "This office worker handles the copyrights. He can use this to copyright one of your elements, and if you use the copyrighted element, you should prepare for the consequences.",
  "Enemy.Office.Patent": "Patent Office Worker",
  "Enemy.Office.Patent.Desc": "This office worker handles the patents. He can use this to patent one of your attack types, and if you use the patented type, you should prepare for the consequences.",
  "Enemy.Office.TheCEO": "The CEO",
  "Enemy.Office.TheCEO.Desc": "The \"brains\" of Spleefium inc., but many think that CEOs are complete morons. Well, he is smart, just not in what he should. He can abuse Copyright and Patents to make some of your skills very dangerous to use.",
  "Enemy.Glitch.Small": "ß¿l´",
  "Enemy.Glitch.Small.Desc": "ERROR 404 ENEMY INFO NOT FOUND",
  "Enemy.Glitch.Glitch": "M=O8Ð¥ÇV7kSY",
  "Enemy.Glitch.Glitch.Desc": "ERROR 0x45424635 ZZiZZeZZmZZwZZlZZiZZ ZZuZZnZZyZZ ZZnZZtZZtZZ ZZ ZFU1ayBNM0lnYiBWa2dOIFdzeGJn (![]+[])[!+[]+!+[]]+(!![]+[][(![]+[])[+!+[]]+(!![]+[])[+[]]])[+!+[]+[+[]]]+(![]+[])[!+[]+!+[]]"
}