{
  "Shop.Anytime": "Anytime",
  "Shop.Battle": "In battle",
  "Shop.Map": "On field",
  "Shop.Never": "Never",
  "Shop.NoOne": "Nobody",
  "Shop.Enemy": "Enemy",
  "Shop.Enemies": "All Enemies",
  "Shop.OneRandom": "Random Enemy",
  "Shop.TwoRandom": "2 Random Enemies",
  "Shop.ThreeRandom": "3 Random Enemies",
  "Shop.FourRandom": "4 Random Enemies",
  "Shop.Ally": "Character",
  "Shop.Allies": "All Alive Chars",
  "Shop.DeadAlly": "Fallen",
  "Shop.DeadAllies": "All Fallen",
  "Shop.AnyAlly": "Any Char",
  "Shop.AnyAllies": "All Chars",
  "Shop.Everyone": "Everybody",
  "Shop.User": "User",
  "Shop.Random": " Random Units",
  "Shop.RandomEnemies": " Rand. Enemies",
  "Shop.RandomAllies": " Rand. Chars",
  "Shop.OtherAllies": "Other Chars",
  "Shop.AllyEnemy": "Ally/Enemy",
  "Shop.EnemyAlly": "Enemy/Ally",
  "Shop.Speed": "Speed",
  "Shop.P3Speed": "Turbo",
  "Shop.P2Speed": "Rapid",
  "Shop.P1Speed": "Fast",
  "Shop.0Speed": "Normal",
  "Shop.N1Speed": "Slow",
  "Shop.N2Speed": "Sluggish",
  "Shop.N3Speed": "Lethargic",
  "Shop.Type": "Type",
  "Shop.SureHit": "True",
  "Shop.Physical": "Material",
  "Shop.Magical": "Magical",
  "Shop.Element": "Element",
  "Shop.Applies": "Applies",
  "Shop.Removes": "Removes",
  "Shop.WeaponElement": "Weapon-Synced",
  "Shop.TrueDamage": "Elementless",
  "Shop.Acc": "Accuraccy",
  "Shop.Hits": "Hits",
  "Shop.HPDamage": "Damage",
  "Shop.MPDamage": "Damage",
  "Shop.TPDamage": "Damage",
  "Shop.HPRecovery": "Recovery",
  "Shop.MPRecovery": "Recovery",
  "Shop.TPRecovery": "Recovery",
  "Shop.HPDrain": "Drain",
  "Shop.MPDrain": "Drain",
  "Shop.Item.Always": "Usable",
  "Shop.Item.Field": "Field",
  "Shop.Item.Battle": "Battle",
  "Shop.Item.Never": "Materials",
  "Shop.Item.Hidden": "Collectibles",
  "Shop.Item.Consumable": "Consumable",
  "Shop.Item.Nonconsumable": "Nonconsumable",
  "Shop.Exit": "Exit",
  "Shop.Owned": "Owned",
  "Shop.Change": "Change",
  "Shop.Net": "Net",
  "Shop.Craft": "Craft",
  "Shop.New": "NEW!",
  "Shop.Cursed1": "has Bound equipment:",
  "Shop.Cursed2": "You can't unequip that until you Unbind it!",
  "Shop.Consumable": " (Consumable)",
  "Shop.Category.Select1": "Pick item(s) of type",
  "Shop.Category.Select2": "(Quantity:",
  "Shop.Category.Selected": " (Selected)",
  "Shop.Category.None": "Uncategorised",

  "Equip.Weapon": "Weapon",
  "Equip.Head": "Headgear",
  "Equip.Body": "Body Armour",
  "Equip.Accessory": "Accessory",
  "Equip.Skill": "Ability",
  "Equip.Card": "Cards",

  "Weapon.Type.Shuriken": "Shuriken",
  "Weapon.Type.Staff": "Staff",
  "Weapon.Type.Cannon": "Cannon",
  "Weapon.Type.Core": "Core",
  "Weapon.Type.Shield": "Shield",

  "Weapon.Starter.Ember": "Heatling Gloves",
  "Weapon.Starter.Ember.Desc": "Ordinary heat-shielding gloves, used to protect the world from a Heatling's heat. Reduces Fire DMG taken by 10%.",
  "Weapon.Starter.Marina": "Fishing Pole",
  "Weapon.Starter.marina.Desc": "Standard-grade novice fishing pole. Makes you wonder why Marina is still using it. Can steal items with Basic Attack.",

  "Armor.Type.Helmet": "Helmet",
  "Armor.Type.Armor": "Armour",
  "Armor.Type.Accessory": "Accessory",
  "Armor.Type.Artefact": "Artefact",
  "Armor.Type.Skill": "Skill",

  "Head.Starter.Ember": "Flame Hairpin",
  "Head.Starter.Ember.Desc": "A simple but effective flame-shaped hairpin. Increases Fire DMG dealt by 1.5%.",
  "Head.Starter.Marina": "Water Goggles",
  "Head.Starter.Marina.Desc": "Great for swimming, even for Waterfolk. Increases Critical Evasion by 2.5%.",
  "Head.Starter.Jacie": "Flying Helmet",
  "Head.Starter.Jacie.Desc": "An aerodynamic helmet, great for casual flight and required for advanced flight. Increases Agility and Evasion by 2.5%.",
  "Head.Starter.Elara": "Esper Headgear",
  "Head.Starter.Elara.Desc": "It's actually to supress the powers from going beyond control. Increases Mana costs by 10%.",
  "Head.Starter.Tsubaki": "Ninja Hood",
  "Head.Starter.Tsubaki.Desc": "Dark, yet stylish. Increases Evasion and Earth DMG dealt by 2%.",
  "Head.Starter.Nekomi": "Feline Hat",
  "Head.Starter.Nekomi.Desc": "A fancy hat, shaped to fit over Nekomi's ears. Increases Luck by 4%.",
  "Head.Starter.Umbra": "Cosmic Helmet",
  "Head.Starter.Umbra.Desc": "Great for keeping your head safe during space travels. Life support included. Reduces Material DMG taken by 5%, and increases HP Regen by 0.5%.",
  "Head.Starter.Hanabi": "Pharmacist's Hat",
  "Head.Starter.Hanabi.Desc": "A good way to show your ability to heal others. Increases Item Effect and Recovery Effect by 10%.",
  "Head.Starter.Lumi": "Fairy Headband",
  "Head.Starter.Lumi.Desc": "A favourite among fairies, especially the Ice ones. Increases Ice DMG dealt by 2.5%.",

  "Armor.Starter.Ember": "Heat Dress",
  "Armor.Starter.Ember.Desc": "A dress that can easily protect the world from a Heatling's overwhelming heat. Decreases Fire DMG taken by 5%, and increases Fire DMG dealt by 2.5%.",
  "Armor.Starter.Marina": "Waterfolk Tankini",
  "Armor.Starter.Marina.Desc": "It's common knowledge that swimsuits take up a large chunk of Waterfolk attire. Provides immunity to Wet, and decreases Water DMG taken by 5%.",
  "Armor.Starter.Jacie": "Flying Suit",
  "Armor.Starter.Jacie.Desc": "An aerodynamic skin-tight suit, with holes in it so that wings can fit through. Increases Agility and Evasion by 2.5%.",
  "Armor.Starter.Elara": "Witch Robe",
  "Armor.Starter.Elara.Desc": "A pretty stereotypical witch's outfit. Increases Mana Regen by 1%, and Max Mana by 5%.",
  "Armor.Starter.Tsubaki": "Ninja Cloak",
  "Armor.Starter.Tsubaki.Desc": "Perfect for being hidden in the shadows. Decreases Aggro by 10%, and increases Earth DMG dealt by 2%.",
  "Armor.Starter.Nekomi": "Protective Catsuit",
  "Armor.Starter.Nekomi.Desc": "Great for protecting from lab accidents and DoTs. Decreases DoT DMG taken by 10%, and increases Agility by 2%.",
  "Armor.Starter.Umbra": "Exoskeleton Spacesuit",
  "Armor.Starter.Umbra.Desc": "Provides all the benefits of a conventional spacesuit, while also working as an exoskeleton for Umbra's invertebrate body. Increases Defence by 5%.",
  "Armor.Starter.Hanabi": "Snow Coat",
  "Armor.Starter.Hanabi.Desc": "A standard measure for protecting against the cold. Decreases Ice DMG taken by 10%.",
  "Armor.Starter.Lumi": "Ice Dress",
  "Armor.Starter.Lumi.Desc": "The material it's made out of is pretty cold to the touch... Decreases Ice DMG taken by 5%, and increases Ice DMG dealt by 5%.",

  "Accessory.Badge.Physical1": "Plain Sticker",
  "Accessory.Badge.Physical1.Desc": "It has a simple, geometric design. Increases Physical DMG dealt by 2.5% and reduces Physical DMG taken by 5%.",
  "Accessory.Badge.Physical2": "Plain Badge",
  "Accessory.Badge.Physical2.Desc": "For some reason, smells like fresh milk. Increases Physical DMG dealt by 5% and reduces Physical DMG taken by 10%.",
  "Accessory.Badge.Physical3": "Plain Emblem",
  "Accessory.Badge.Physical3.Desc": "Looks like a minature priority road sign. Increases Physical DMG dealt by 7.5% and reduces Physical DMG taken by 15%.",
  "Accessory.Badge.Physical4": "Plain Medallion",
  "Accessory.Badge.Physical4.Desc": "This one doesn't sound as much of an accomplishment... Increases Physical DMG dealt by 10% and reduces Physical DMG taken by 20%.",
  "Accessory.Badge.Fire1": "Volcano Sticker",
  "Accessory.Badge.Fire1.Desc": "Fittingly enough found on the peak of the Volcano of Mercy. Increases Fire DMG dealt by 2.5% and reduces Fire DMG taken by 5%.",
  "Accessory.Badge.Fire2": "Volcano Badge",
  "Accessory.Badge.Fire2.Desc": "Did you manage to catch the reference in the obtaining order of the stickers? Increases Fire DMG dealt by 5% and reduces Fire DMG taken by 10%.",
  "Accessory.Badge.Fire3": "Volcano Emblem",
  "Accessory.Badge.Fire3.Desc": "Fire is hands-down the best element. Increases Fire DMG dealt by 7.5% and reduces Fire DMG taken by 15%.",
  "Accessory.Badge.Fire4": "Volcano Medallion",
  "Accessory.Badge.Fire4.Desc": "Through the fire and flames, you got one of the hottest accessories in the game. Increases Fire DMG dealt by 10% and reduces Fire DMG taken by 20%.",
  "Accessory.Badge.Ice1": "Glacier Sticker",
  "Accessory.Badge.Ice1.Desc": "It feels oddly cold to touch. Increases Ice DMG dealt by 2.5% and reduces Ice DMG taken by 5%.",
  "Accessory.Badge.Ice2": "Glacier Badge",
  "Accessory.Badge.Ice2.Desc": "One of the oldest badges, yet it looks brand new. Increases Ice DMG dealt by 5% and reduces Ice DMG taken by 10%.",
  "Accessory.Badge.Ice3": "Glacier Emblem",
  "Accessory.Badge.Ice3.Desc": "Hexagons are the bestagons! Increases Ice DMG dealt by 7.5% and reduces Ice DMG taken by 15%.",
  "Accessory.Badge.Ice4": "Glacier Medallion",
  "Accessory.Badge.Ice4.Desc": "You don't know what \"cold\" really means... Increases Ice DMG dealt by 10% and reduces Ice DMG taken by 20%.",
  "Accessory.Badge.Electricity1": "Thunder Sticker",
  "Accessory.Badge.Electricity1.Desc": "It tingles! Increases Electrical DMG dealt by 2.5% and reduces Electrical DMG taken by 5%.",
  "Accessory.Badge.Electricity2": "Thunder Badge",
  "Accessory.Badge.Electricity2.Desc": "Honestly, this one looks kinda like a sunflower. Increases Electrical DMG dealt by 5% and reduces Electrical DMG taken by 10%.",
  "Accessory.Badge.Electricity3": "Thunder Emblem",
  "Accessory.Badge.Electricity3.Desc": "It's really a shame that DoTs don't benefit from DMG bonuses... Increases Electrical DMG dealt by 7.5% and reduces Electrical DMG taken by 15%.",
  "Accessory.Badge.Electricity4": "Thunder Medallion",
  "Accessory.Badge.Electricity4.Desc": "This truly looks like something straight-up blessed by the Thunder God. Increases Electrical DMG dealt by 10% and reduces Electrical DMG taken by 20%.",
  "Accessory.Badge.Water1": "Cascade Sticker",
  "Accessory.Badge.Water1.Desc": "It feels wet, yet it still sticks perfectly fine. Increases Water DMG dealt by 2.5% and reduces Water DMG taken by 5%.",
  "Accessory.Badge.Water2": "Cascade Badge",
  "Accessory.Badge.Water2.Desc": "You might wonder why it's related to Haniwa... Increases Water DMG dealt by 5% and reduces Water DMG taken by 10%.",
  "Accessory.Badge.Water3": "Cascade Emblem",
  "Accessory.Badge.Water3.Desc": "Great if you don't mind having too much water. Increases Water DMG dealt by 7.5% and reduces Water DMG taken by 15%.",
  "Accessory.Badge.Water4": "Cascade Medallion",
  "Accessory.Badge.Water4.Desc": "It's so powerful and beautiful it makes you wet. Increases Water DMG dealt by 10% and reduces Water DMG taken by 20%.",
  "Accessory.Badge.Earth1": "Boulder Sticker",
  "Accessory.Badge.Earth1.Desc": "It can be used as a plaster in a pinch. Increases Earth DMG dealt by 2.5% and reduces Earth DMG taken by 5%.",
  "Accessory.Badge.Earth2": "Boulder Badge",
  "Accessory.Badge.Earth2.Desc": "It will make you a Geo-aligned dude! Increases Earth DMG dealt by 5% and reduces Earth DMG taken by 10%.",
  "Accessory.Badge.Earth3": "Boulder Emblem",
  "Accessory.Badge.Earth3.Desc": "Still not heavy enough to have to push it, or smash it with your pickaxe. Increases Earth DMG dealt by 7.5% and reduces Earth DMG taken by 15%.",
  "Accessory.Badge.Earth4": "Boulder Medallion",
  "Accessory.Badge.Earth4.Desc": "It's weird to have a literal boulder as a pendant... Increases Earth DMG dealt by 10% and reduces Earth DMG taken by 20%.",
  "Accessory.Badge.Wind1": "Zephyr Sticker",
  "Accessory.Badge.Wind1.Desc": "Named after a mythologial wind, just because it sounds cool. Increases Wind DMG dealt by 2.5% and reduces Wind DMG taken by 5%.",
  "Accessory.Badge.Wind2": "Zephyr Badge",
  "Accessory.Badge.Wind2.Desc": "\"Flying\" and \"Wind\" are basically the same thing, right? Increases Wind DMG dealt by 5% and reduces Wind DMG taken by 10%.",
  "Accessory.Badge.Wind3": "Zephyr Emblem",
  "Accessory.Badge.Wind3.Desc": "it... heckin'... WIMDY... Increases Wind DMG dealt by 7.5% and reduces Wind DMG taken by 15%.",
  "Accessory.Badge.Wind4": "Zephyr Medallion",
  "Accessory.Badge.Wind4.Desc": "Watch your enemies vanish in an instant once you blast them with a wind as powerful as a tornado. Increases Wind DMG dealt by 10% and reduces Wind DMG taken by 20%.",
  "Accessory.Badge.Star1": "Rainbow Sticker",
  "Accessory.Badge.Star1.Desc": "A beautiful sticker, reminding you of the rainbows let by the sunlight when it rains. Increases Star DMG dealt by 2.5% and reduces Star DMG taken by 5%.",
  "Accessory.Badge.Star2": "Rainbow Badge",
  "Accessory.Badge.Star2.Desc": "I know that it's technically \"Grass\", but I ran out of options! Increases Star DMG dealt by 5% and reduces Star DMG taken by 10%.",
  "Accessory.Badge.Star3": "Rainbow Emblem",
  "Accessory.Badge.Star3.Desc": "The Sun is a star, right? Right? Increases Star DMG dealt by 7.5% and reduces Star DMG taken by 15%.",
  "Accessory.Badge.Star4": "Rainbow Medallion",
  "Accessory.Badge.Star4.Desc": "It's as bright as a star. You're lucky that there's no nucleogenesis happening in it. Increases Star DMG dealt by 10% and reduces Star DMG taken by 20%.",
  "Accessory.Badge.Void1": "Fog Sticker",
  "Accessory.Badge.Void1.Desc": "Its true nature is shrouded in mystery... Increases Void DMG dealt by 2.5% and reduces Void DMG taken by 5%.",
  "Accessory.Badge.Void2": "Fog Badge",
  "Accessory.Badge.Void2.Desc": "I could use \"Dark\" instead of \"Ghost\", you say. Then, go ask why there is no Dark gym in Gen II. Increases Void DMG dealt by 5% and reduces Void DMG taken by 10%.",
  "Accessory.Badge.Void3": "Fog Emblem",
  "Accessory.Badge.Void3.Desc": "You get some alien vibes from it... Increases Void DMG dealt by 7.5% and reduces Void DMG taken by 15%.",
  "Accessory.Badge.Void4": "Fog Medallion",
  "Accessory.Badge.Void4.Desc": "Return to Nihility, where this meaningless world belongs. Increases Void DMG dealt by 10% and reduces Void DMG taken by 20%.",
  "Accessory.Badge.Elementless1": "Rising Sticker",
  "Accessory.Badge.Elementless1.Desc": "Slightly weaker in raw stats, but it compensates with full coverage! Increases DMG dealt by 2% and reduces DMG taken by 4%.",
  "Accessory.Badge.Elementless2": "Rising Badge",
  "Accessory.Badge.Elementless2.Desc": "Draconic power blesses this badge with mastery over all elements. Increases DMG dealt by 4% and reduces DMG taken by 8%.",
  "Accessory.Badge.Elementless3": "Rising Emblem",
  "Accessory.Badge.Elementless3.Desc": "Unleash your inner dragon, and then all you have to do is to jump up, kick back... Increases DMG dealt by 6% and reduces DMG taken by 12%.",
  "Accessory.Badge.Elementless4": "Rising Medallion",
  "Accessory.Badge.Elementless4.Desc": "There is no room for error, and you have to be prepared for everything. Increases DMG dealt by 8% and reduces DMG taken by 16%.",
  "Accessory.Coating.Physical1": "Wounding Coating",
  "Accessory.Coating.Physical1.Desc": "A coating that makes attacks better at causing wounds. Decreases Physical DMG taken by 2.5%, and grants all of your attacks a chance to apply Wounded",
  "Accessory.Coating.Physical2": "Sharpening Coating",
  "Accessory.Coating.Physical2.Desc": "It might not sound stronger than the Wounding Coating, but trust me, it actually can cause pain. Decreases Physical DMG taken by 5%, and makes all of your attacks a chance to apply Wounded and/or Bleed",
  "Accessory.Coating.Fire1": "Heated Coating",
  "Accessory.Coating.Fire1.Desc": "It feels like a Heatling's hug, in all the bad ways. Decreases Fire DMG taken by 2.5%, and grants all of your attacks a chance to apply Singed",
  "Accessory.Coating.Fire2": "Burning Coating",
  "Accessory.Coating.Fire2.Desc": "Let the flames of Strife set the seas ablaze, or something like that. Decreases Fire DMG taken by 5%, and makes all of your attacks a chance to apply Singed and/or Burn",
  "Accessory.Coating.Ice1": "Frigid Coating",
  "Accessory.Coating.Ice1.Desc": "It actually sounds like a nice way to cool off on hot days. Decreases Ice DMG taken by 2.5%, and grants all of your attacks a chance to apply Frost.",
  "Accessory.Coating.Ice2": "Frostburn Coating",
  "Accessory.Coating.Ice2.Desc": "The one time when Ice and Fire actually go together... Decreases Ice DMG taken by 5%, and makes all of your attacks a chance to apply Frost and/or Frostburn.",
  "Accessory.Coating.Electricity1": "Electrifying Coating",
  "Accessory.Coating.Electricity1.Desc": "Works best on weapons that are made out of a conductive material. Decreases Electrical DMG taken by 2.5%, and grants all of your attacks a chance to apply Electrified.",
  "Accessory.Coating.Electricity2": "Overcharged Coating",
  "Accessory.Coating.Electricity2.Desc": "Now, let the Sadist's Trial begin, and the Metamorphosis shall start... Decreases Electrical DMG taken by 5%, and makes all of your attacks a chance to apply Electrified and/or Shock.",
  "Accessory.Coating.Water1": "Wetting Coating",
  "Accessory.Coating.Water1.Desc": "No matter how much you try to dry it, it'll stay wet. Just like your hair after a shower. Decreases Water DMG taken by 2.5%, and grants all of your attacks a chance to apply Wet.",
  "Accessory.Coating.Water2": "Eroding Coating",
  "Accessory.Coating.Water2.Desc": "Don't worry, it won't damage your weapons. Decreases Water DMG taken by 5%, and makes all of your attacks a chance to apply Wet and/or Erosion.",
  "Accessory.Coating.Earth1": "Gorgon Coating",
  "Accessory.Coating.Earth1.Desc": "Don't put it into your eyes please. Decreases Earth DMG taken by 2.5%, and grants all of your attacks a chance to apply Mild Petrification.",
  "Accessory.Coating.Earth2": "Preservation's Coating",
  "Accessory.Coating.Earth2.Desc": "By gathering the Blessings and Power, you can make the ground itself tremble. Plus, you don't need a shielder. Decreases Earth DMG taken by 5%, and makes all of your attacks a chance to apply Mild Petrification and/or Quake.",
  "Accessory.Coating.Wind1": "Windy Coating",
  "Accessory.Coating.Wind1.Desc": "It feels like a mild breeze and a tornado at the same time. Decreases Wind DMG taken by 2.5%, and grants all of your attacks a chance to apply Mighty Wind.",
  "Accessory.Coating.Wind2": "Storm Coating",
  "Accessory.Coating.Wind2.Desc": "It feels like the wind is all around you... Decreases Wind DMG taken by 5%, and makes all of your attacks a chance to apply Mighty Wind and/or Wind Shear.",
  "Accessory.Coating.Star1": "Stellar Coating",
  "Accessory.Coating.Star1.Desc": "It's common knowledge not to get too close to the Sun, as not only you might get burned, but also uncover secrets you're not ready for. Decreases Star DMG taken by 2.5%, and grants all of your attacks a chance to apply Starshred.",
  "Accessory.Coating.Star2": "Astral Coating",
  "Accessory.Coating.Star2.Desc": "Most stars are too far away to even get close to them, and a lot of the stars on the night sky don't actually exist anymore. Decreases Star DMG taken by 5%, and makes all of your attacks a chance to apply Starshred and/or Starburn.",
  "Accessory.Coating.Void1": "Voided Coating",
  "Accessory.Coating.Void1.Desc": "Void provides ways to make enemy attacks not threatening in the slightest. Decreases Void DMG taken by 2.5%, and grants all of your attacks a chance to apply Voided Attacks.",
  "Accessory.Coating.Void2": "Faded Coating",
  "Accessory.Coating.Void2.Desc": "\"Then all thay'd be left is to fade...\" Decreases Void DMG taken by 5%, and makes all of your attacks a chance to apply Voided Attacks and/or Fadeaway.",
  "Accessory.Coating.Elementless1": "Weakening Coating",
  "Accessory.Coating.Elementless1.Desc": "Weakening enemies is a classic, yet underutilised trick. Decreases DMG taken by 2%, and grants all of your attacks a chance to apply Weakness.",
  "Accessory.Coating.Elementless2": "Poison-laden Coating",
  "Accessory.Coating.Elementless2.Desc": "Wait, if you apply it with a weapon and they die, is it still a poison or already venom? Decreases DMG taken by 4%, and makes all of your attacks a chance to apply Weakness and/or Poison.",

  "Item.MindStone": "Mind Stone",
  "Item.MindStone.Desc": "A magical stone that can warp you straight to the Mindscape, where you can upgrade your characters.",
  "Item.WarpStone": "Warp Stone",
  "Item.WarpStone.Desc": "A magical stone that can warp you straight to the Warp Zone, where you can select where you should go next.",

  "Item.Throw.ThrowingKnife": "Throwing Knife",
  "Item.Throw.ThrowingKnife.Desc": "Your standard-grade throwing knife. Deals Physical damage to a single enemy, and may make them Bleed.",
  "Item.Throw.Fireball": "Fireball",
  "Item.Throw.Fireball.Desc": "I think you shouldn't hold it in your bare hands. Deals Fire damage to a single enemy, and will Burn them.",
  "Item.Throw.Iceball": "Iceball",
  "Item.Throw.Iceball.Desc": "Who knew balls of ice would be that good to throw? Deals Ice damage to a single enemy, will apply Frostburn, and reduce a single stat by 1 stage.",
  "Item.Throw.WaterBalloon": "Water Balloon",
  "Item.Throw.WaterBalloon.Desc": "Avaliable in various colour variants. Deals Water damage to a single enemy + some damage to other enemies, and will apply Wet.",
  "Item.Throw.DazzlingShuriken": "Dazzling Shuriken",
  "Item.Throw.DazzlingShuriken.Desc": "A cosmic-grade weapon, used only by the best ninja in the universe. Deals Star damage to all enemies, and has a chance to apply Radiated.",

  "Item.Food.Apple": "Apple",
  "Item.Food.Apple.Desc": "A red apple that definitely isn't bad. It's not shiny, because a shiny apple is green. Restores 200 + 2.5% HP.",
  "Item.Food.Orange": "Orange",
  "Item.Food.Orange.Desc": "One of the few non-sour citrus fruits. Restores 400 + 5% HP.",
  "Item.Food.Tomato": "Tomato",
  "Item.Food.Tomato.Desc": "The fruit that's the main ingredient of ketchup. Restores 600 + 7.5% HP.",
  "Item.Food.Cheese": "Cheese",
  "Item.Food.Cheese.Desc": "Basically solid milk, but ages like fine wine. Restores 800 + 10% HP.",
  "Item.Food.Cherries": "Cherries",
  "Item.Food.Cherries.Desc": "How are you supposed to divide two small fruits between 5 people? Restores 150 + 2% HP to all characters.",
  "Item.Food.Blueberries": "Blueberries",
  "Item.Food.Blueberries.Desc": "Don't worry, these berries actually ARE berries. Restores 300 + 4% HP to all characters.",
  "Item.Food.Grapes": "Grapes",
  "Item.Food.Grapes.Desc": "The favourite fruit of a drunkard. Restores 450 + 6% HP to all characters.",
  "Item.Food.Bread": "Bread",
  "Item.Food.Bread.Desc": "Ah, yes, truly a fruit indeed. Restores 600 + 8% HP to all characters.",
  "Item.Food.Onion": "Onion",
  "Item.Food.Onion.Desc": "The most ogre-like veggie. Cures the character from all stat debuffs.",
  "Item.Food.Carrot": "Carrot",
  "Item.Food.Carrot.Desc": "A veggie that came to here from 1000 light years away. Cures the character from all elemental debuffs, DoTs, and CCs.",
  "Item.Food.Pepper": "Pepper",
  "Item.Food.Pepper.Desc": "As it's a bell pepper, it's unsuprisingly not spicy. Cures the character from most non-elemental status effects.",
  "Item.Food.Coffee": "Coffee",
  "Item.Food.Coffee.Desc": "Strong enough to raise the dead, apparently. Revives a single ally with 25% HP.",
  "Item.Food.Peanut": "Peanut",
  "Item.Food.Peanut.Desc": "\"But this delicious nut... is not a nut!\" Increases MHP and MMP of a single ally by 3 stages for 5 turns.",
  "Item.Food.Leek": "Leek",
  "Item.Food.Leek.Desc": "Perfect for spinning in your hand while singing a Polka. Increases ATK and MAT of a single ally by 3 stages for 5 turns.",
  "Item.Food.Mushroom": "Mushroom",
  "Item.Food.Mushroom.Desc": "Don't worry, it won't take up too mush room in your inventory. Increases DEF and MDF of a single ally by 3 stages for 5 turns.",
  "Item.Food.Fish": "Fish",
  "Item.Food.Fish.Desc": "Perfect with a chocolate sauce. Increases AGI and LUK of a single ally by 3 stages for 5 turns.",

  "Item.Potion.Healing.Lesser": "Lesser Healing Potion",
  "Item.Potion.Healing.Lesser.Desc": "Made out of some mushrooms and slime. Restores 250 HP.",
  "Item.Potion.Healing.Normal": "Healing Potion",
  "Item.Potion.Healing.Normal.Desc": "Great to use in a pinch. Restores 500 HP.",
  "Item.Potion.Healing.Greater": "Greater Healing Potion",
  "Item.Potion.Healing.Greater.Desc": "A good option for healing in the later 3/5 of the adventure. Restores 750 HP.",
  "Item.Potion.Healing.Super": "Super Healing Potion",
  "Item.Potion.Healing.Super.Desc": "It's so good that you can swear that some of its ingredients came from space. Restores 1000 HP.",
  "Item.Potion.Healing.Supreme": "Supreme Healing Potion",
  "Item.Potion.Healing.Supreme.Desc": "It's so good that it's almost calamitous. Restores 1250 HP.",
  "Item.Potion.Mana.Lesser": "Lesser Mana Potion",
  "Item.Potion.Mana.Lesser.Desc": "Mana is a form of energy, so there needed to be a lot of heat to make this little potion. Restores 50 + 4% Mana.",
  "Item.Potion.Mana.Normal": "Mana Potion",
  "Item.Potion.Mana.Normal.Desc": "One potion can keep your kit running for longer, especially if you have a lot of MMP. Restores 100 + 8% Mana.",
  "Item.Potion.Mana.Greater": "Greater Mana Potion",
  "Item.Potion.Mana.Greater.Desc": "Even with the same cost-per-mana, the better potions are simply turn-effective. Restores 150 + 12% Mana.",
  "Item.Potion.Mana.Super": "Super Mana Potion",
  "Item.Potion.Mana.Super.Desc": "Made from fallen stars, crystals, unicorn horns, and other magical crap. Restores 200 + 16% Mana.",
  "Item.Potion.Mana.Supreme": "Supreme Mana Potion",
  "Item.Potion.Mana.Supreme.Desc": "There's so much mana stored in this little vial that it looks like it's about to burst. Restores 250 + 20% Mana.",
  "Item.Potion.Energy.Lesser": "Lesser Energy Potion",
  "Item.Potion.Energy.Lesser.Desc": "You don't have anything to do? Maybe you could give some Energy to your allies! Restores 15 Energy.",
  "Item.Potion.Energy.Normal": "Energy Potion",
  "Item.Potion.Energy.Normal.Desc": "It has a little bit of a kick, but it's not too strong. Restores 30 Energy.",
  "Item.Potion.Energy.Greater": "Greater Energy Potion",
  "Item.Potion.Energy.Greater.Desc": "Finally, an Energy Potion strong enough to warrant using it on yourself. Restores 45 Energy.",
  "Item.Potion.Energy.Super": "Super Energy Potion",
  "Item.Potion.Energy.Super.Desc": "Faster ultimate rotation is always good, right? Restores 60 Energy.",
  "Item.Potion.Energy.Supreme": "Supreme Energy Potion",
  "Item.Potion.Energy.Supreme.Desc": "This bad boi is basically a bottled Ultimate. Restores 75 Energy.",
  "Item.Potion.Restoration.Lesser": "Lesser Restoration Potion",
  "Item.Potion.Restoration.Lesser.Desc": "4/5 the efficiency, at a 10% markup. At least it combines the effects of all the potions. Restores 200 HP, 40 + 4% Mana, and 12 Energy.",
  "Item.Potion.Restoration.Normal": "Restoration Potion",
  "Item.Potion.Restoration.Normal.Desc": "Made by tossing a Healing, Mana, and Energy Potion into a cauldron and hoping for the best. Restores 400 HP, 80 + 8% Mana, and 24 Energy.",
  "Item.Potion.Restoration.Greater": "Greater Restoration Potion",
  "Item.Potion.Restoration.Greater.Desc": "Despite the 10% markup, the sheer turn-efficiency is worth using it. Restores 600 HP, 120 + 12% Mana, and 36 Energy.",
  "Item.Potion.Restoration.Super": "Super Restoration Potion",
  "Item.Potion.Restoration.Super.Desc": "A potion made out of space crap, magical crap, and whatever crap the Super Energy Potion is made of. Restores 800 HP, 160 + 16% Mana, and 48 Energy.",
  "Item.Potion.Restoration.Supreme": "Supreme Restoration Potion",
  "Item.Potion.Restoration.Supreme.Desc": "This thing is the definite potion. Stock up on these, and you won't use any other potion ever again. Restores 1000 HP, 200 + 20% Mana, and 60 Energy.",
  "Item.Potion.Buff.MHP1": "Vitality Potion",
  "Item.Potion.Buff.MHP1.Desc": "Great if you need some boost to your health. Increases MHP of all allies by 10% for the next battle. Only 1 Defensive Potion can be active at a time.",
  "Item.Potion.Buff.MHP2": "Lifeforce Potion",
  "Item.Potion.Buff.MHP2.Desc": "It increases your life so much that it might actually extend your lifespan by a bit. Increases MHP of all allies by 25% for the next battle. Only 1 Defensive Potion can be active at a time.",
  "Item.Potion.Buff.MMP1": "Lingering Mana Potion",
  "Item.Potion.Buff.MMP1.Desc": "Great if you suck at managing your mana. Increases MMP of all allies by 10% for the next battle. Only 1 Offensive Potion can be active at a time.",
  "Item.Potion.Buff.MMP2": "Starpower Potion",
  "Item.Potion.Buff.MMP2.Desc": "The perfect shield against mana management skill issue. Increases MMP of all allies by 25% for the next battle. Only 1 Offensive Potion can be active at a time.",
  "Item.Potion.Buff.ATK1": "Strength Potion",
  "Item.Potion.Buff.ATK1.Desc": "A potion that makes you feel able to lift way more than usual. Increases ATK of all allies by 10% for the next battle. Only 1 Offensive Potion can be active at a time.",
  "Item.Potion.Buff.ATK2": "Superhuman Potion",
  "Item.Potion.Buff.ATK2.Desc": "...did Tsubaki fell into a cauldron of this thing as a baby? Increases ATK of all allies by 25% for the next battle. Only 1 Offensive Potion can be active at a time.",
  "Item.Potion.Buff.DEF1": "Ironskin Potion",
  "Item.Potion.Buff.DEF1.Desc": "Don't worry, it's made out of Iron, not Lead. Increases DEF of all allies by 10% for the next battle. Only 1 Defensive Potion can be active at a time.",
  "Item.Potion.Buff.DEF2": "Endurance Potion",
  "Item.Potion.Buff.DEF2.Desc": "This thing makes your body so hard that it can shatter a sword that impacts it. Increases DEF of all allies by 25% for the next battle. Only 1 Defensive Potion can be active at a time.",
  "Item.Potion.Buff.MAT1": "Magic Power Potion",
  "Item.Potion.Buff.MAT1.Desc": "If you need for your magic to have that extra kick to it, this is perfect for you. Increases MAT of all allies by 10% for the next battle. Only 1 Offensive Potion can be active at a time.",
  "Item.Potion.Buff.MAT2": "Magic Might Potion",
  "Item.Potion.Buff.MAT2.Desc": "Use all of your might, this is going to make your magical damage absolutely plus ultra! Increases MAT of all allies by 25% for the next battle. Only 1 Offensive Potion can be active at a time.",
  "Item.Potion.Buff.MDF1": "Magical Shield Potion",
  "Item.Potion.Buff.MDF1.Desc": "If you're constantly losing in spellcasting battles, this is perfect for you. Increases MDF of all allies by 10% for the next battle. Only 1 Defensive Potion can be active at a time.",
  "Item.Potion.Buff.MDF2": "Magical Immunity Potion",
  "Item.Potion.Buff.MDF2.Desc": "Well, it doesn't give you true immunity to magic, but still. Increases MDF of all allies by 25% for the next battle. Only 1 Defensive Potion can be active at a time.",
  "Item.Potion.Buff.AGI1": "Swiftness Potion",
  "Item.Potion.Buff.AGI1.Desc": "More turns are always going to be useful. Increases AGI of all allies by 10% for the next battle. Only 1 Offensive Potion can be active at a time.",
  "Item.Potion.Buff.AGI2": "Trubo Potion",
  "Item.Potion.Buff.AGI2.Desc": "Don't underestimate the potency of getting so many actions. Increases AGI of all allies by 25% for the next battle. Only 1 Offensive Potion can be active at a time.",
  "Item.Potion.Buff.LUK1": "Luck Potion",
  "Item.Potion.Buff.LUK1.Desc": "Unhappy? Unlucky? Drink this and be happy! Increases LUK of all allies by 10% for the next battle. Only 1 Offensive Potion can be active at a time.",
  "Item.Potion.Buff.LUK2": "Dream Potion",
  "Item.Potion.Buff.LUK2.Desc": "Increases your luck so hard it might look like cheating. Increases LUK of all allies by 25% for the next battle. Only 1 Offensive Potion can be active at a time.",
  "Item.Potion.Element.Physical": "Physical Affinity Potion",
  "Item.Potion.Element.Physical.Desc": "A potion that will make you both stronger and more durable. Increases Physical DMG and Physical RES of all allies by 10% for the next battle. Only 1 Elemental Affinity Potion can be active at a time.",
  "Item.Potion.Element.Fire": "Fire Affinity Potion",
  "Item.Potion.Element.Fire.Desc": "Chug this, and channel your inner Heatling! Increases Fire DMG and Fire RES of all allies by 10% for the next battle. Only 1 Elemental Affinity Potion can be active at a time.",
  "Item.Potion.Element.Ice": "Ice Affinity Potion",
  "Item.Potion.Element.Ice.Desc": "Commonly used by hikers to withstand the cold. Increases Ice DMG and Ice RES of all allies by 10% for the next battle. Only 1 Elemental Affinity Potion can be active at a time.",
  "Item.Potion.Element.Electricity": "Electricity Affinity Potion",
  "Item.Potion.Element.Electricity.Desc": "Sitting on an electric chair was never before this non-lethal. Increases Electrical DMG and Electricity RES of all allies by 10% for the next battle. Only 1 Elemental Affinity Potion can be active at a time.",
  "Item.Potion.Element.Water": "Water Affinity Potion",
  "Item.Potion.Element.Water.Desc": "Won't give you the ability to breathe water, but it's still useful. Increases Water DMG and Water RES of all allies by 10% for the next battle. Only 1 Elemental Affinity Potion can be active at a time.",
  "Item.Potion.Element.Earth": "Earth Affinity Potion",
  "Item.Potion.Element.Earth.Desc": "\"Earth\" is the name of the element, not this world! Increases Earth DMG and Earth RES of all allies by 10% for the next battle. Only 1 Elemental Affinity Potion can be active at a time.",
  "Item.Potion.Element.Wind": "Wind Affinity Potion",
  "Item.Potion.Element.Wind.Desc": "Great for a very windy day. Or when a tornado is passing through. Increases Wind DMG and Wind RES of all allies by 10% for the next battle. Only 1 Elemental Affinity Potion can be active at a time.",
  "Item.Potion.Element.Star": "Star Affinity Potion",
  "Item.Potion.Element.Star.Desc": "Aligns you with the stars. Increases Star DMG and Star RES of all allies by 10% for the next battle. Only 1 Elemental Affinity Potion can be active at a time.",
  "Item.Potion.Element.Void": "Void Affinity Potion",
  "Item.Potion.Element.Void.Desc": "Contemplate the Void of the Cosmos, and also drink it. Increases Void DMG and Void RES of all allies by 10% for the next battle. Only 1 Elemental Affinity Potion can be active at a time.",

  "Item.Steroid.Hana.MHP": "Udon",
  "Item.Steroid.Hana.MHP.Desc": "Some basic yet hearty noodles. Permanently increases Hana's MHP by 10, and MMP by 5.",
  "Item.Steroid.Hana.ATK": "Dango",
  "Item.Steroid.Hana.ATK.Desc": "Hana's favourite snack, and for a good reason. Permanently increases Hana's ATK and DEF by 1.",
  "Item.Steroid.Hana.MAT": "Ramen",
  "Item.Steroid.Hana.MAT.Desc": "A hot soup that will fill you up. Permanently increases Hana's MAT and MDF by 1.",
  "Item.Steroid.Hana.AGI": "Sushi",
  "Item.Steroid.Hana.AGI.Desc": "Basically raw fish wrapped in seaweed and rice. Permanently increases Hana's AGI and LUK by 1.",
  "Item.Steroid.Jace.MHP": "Ribs",
  "Item.Steroid.Jace.MHP.Desc": "Some great pork ribs, marinated in honey and ketchup. Permanently increases Jace's MHP by 10 and MMP by 5.",
  "Item.Steroid.Jace.ATK": "Bigos",
  "Item.Steroid.Jace.ATK.Desc": "Cabbage traditionally cooked in tomato sauce with sausage. Permanently increases Jace's ATK and DEF by 1.",
  "Item.Steroid.Jace.MAT": "Spaghetti",
  "Item.Steroid.Jace.MAT.Desc": "A plate with fine-grade spaghetti, a favourite of the God of Feasts. Permanently increases Jace's MAT and MDF by 1.",
  "Item.Steroid.Jace.AGI": "Pancakes",
  "Item.Steroid.Jace.AGI.Desc": "A stack of pancakes with chocolate spread. Permanently increases Jace's AGI and LUK by 1.",
  "Item.Steroid.Sachimi.MHP": "Rations",
  "Item.Steroid.Sachimi.MHP.Desc": "Military rations specifically provided for performance. Permanently increases Sachimi's MHP by 10 and MMP by 5.",
  "Item.Steroid.Sachimi.ATK": "Cereal",
  "Item.Steroid.Sachimi.ATK.Desc": "One of the simplest foods imaginable. Permanently increases Sachimi's ATK and DEF by 1.",
  "Item.Steroid.Sachimi.MAT": "Kibble",
  "Item.Steroid.Sachimi.MAT.Desc": "Some good-quality cat food. Sachimi doesn't really want to show that it's her favourite. Permanently increases Sachimi's MAT and MDF by 1.",
  "Item.Steroid.Sachimi.AGI": "Cake Roll",
  "Item.Steroid.Sachimi.AGI.Desc": "A dessert, now made with cat-safe ingredients Permanently increases Sachimi's AGI and LUK by 1.",
  "Item.Steroid.Sylph.MHP": "Slime Feed",
  "Item.Steroid.Sylph.MHP.Desc": "A pet food specifically made for caring about slimes. Sylph still likes it though. Permanently increases Sylph's MHP by 10 and MMP by 5.",
  "Item.Steroid.Sylph.ATK": "Slushie",
  "Item.Steroid.Sylph.ATK.Desc": "Perfect for a hotter day, or just as a sweet refresher. Permanently increases Sylph's ATK and DEF by 1.",
  "Item.Steroid.Sylph.MAT": "Melting Cream",
  "Item.Steroid.Sylph.MAT.Desc": "Some pink-coloured whipped cream that already started to melt. Permanently increases Sylph's MAT and MDF by 1.",
  "Item.Steroid.Sylph.AGI": "Fruit Kissel",
  "Item.Steroid.Sylph.AGI.Desc": "It was made from a powder, so it won't matter that it was 2 years expired. Permanently increases Sylph's AGI and LUK by 1.",
  "Item.Steroid.Helpy.MHP": "Pizza Slice",
  "Item.Steroid.Helpy.MHP.Desc": "How does Helpy consume human food as an android? Permanently increases Helpy's MHP by 10 and MMP by 5.",
  "Item.Steroid.Helpy.ATK": "Waffle",
  "Item.Steroid.Helpy.ATK.Desc": "A simple yet geometrical waffle. Permanently increases Helpy's ATK and DEF by 1.",
  "Item.Steroid.Helpy.MAT": "Coolant",
  "Item.Steroid.Helpy.MAT.Desc": "A liquid that can cool off mechanical parts, when applied correctly of course. Permanently increases Helpy's MAT and MDF by 1.",
  "Item.Steroid.Helpy.AGI": "Machine Oil",
  "Item.Steroid.Helpy.AGI.Desc": "It can be used in case of Helpy's motors being stuck, or other things needing some maintenance. Permanently increases Helpy's AGI and LUK by 1.",
  "Item.Steroid.Candy.MHP": "Peach Candy",
  "Item.Steroid.Candy.MHP.Desc": "A heart-shaped hard candy. Increases all characters' MHP by 10.",
  "Item.Steroid.Candy.MMP": "Apricot Candy",
  "Item.Steroid.Candy.MMP.Desc": "A star-shaped hard candy. Increases all characters' MMP by 5.",
  "Item.Steroid.Candy.ATK": "Lemon Candy",
  "Item.Steroid.Candy.ATK.Desc": "A sword-shaped hard candy. Increases all characters' ATK by 1.",
  "Item.Steroid.Candy.DEF": "Orange Candy",
  "Item.Steroid.Candy.DEF.Desc": "A shield-shaped hard candy. Increases all characters' DEF by 1.",
  "Item.Steroid.Candy.MAT": "Blueberry Candy",
  "Item.Steroid.Candy.MAT.Desc": "An orb-shaped hard candy. Increases all characters' MAT by 1.",
  "Item.Steroid.Candy.MDF": "Elderberry Candy",
  "Item.Steroid.Candy.MDF.Desc": "A hexagon-shaped hard candy. Increases all characters' MDF by 1.",
  "Item.Steroid.Candy.AGI": "Mint Candy",
  "Item.Steroid.Candy.AGI.Desc": "A lightning-shaped hard candy. Increases all characters' AGI by 1.",
  "Item.Steroid.Candy.LUK": "Cola Candy",
  "Item.Steroid.Candy.LUK.Desc": "A bottle-shaped hard candy. Increases all characters' LUK by 1.",
  "Item.Steroid.Candy.All": "Candy Bag",
  "Item.Steroid.Candy.All.Desc": "A bag full of hard candy. Increases all characters' MHP by 10, MMP by 5, and ATK/DEF/MAT/MDF/AGI/LUK by 1.",

  "Item.EMat.Low.Physical": "Sharpened Metal",
  "Item.EMat.Low.Physical.Desc": "A piece of metal that's perfect for a sword. (Low-tier Physical Material)",
  "Item.EMat.Low.Fire": "Flaming Embers",
  "Item.EMat.Low.Fire.Desc": "Remnants of something that has burned down. (Low-tier Fire Material)",
  "Item.EMat.Low.Ice": "Snow",
  "Item.EMat.Low.Ice.Desc": "Fun fact: Snow is basically powdered ice. (Low-tier Ice Material)",
  "Item.EMat.Low.Electricity": "Copper",
  "Item.EMat.Low.Electricity.Desc": "Beloved for conducting electricity and for the beautiful colour of patina. (Low-tier Electrical Material)",
  "Item.EMat.Low.Water": "Dew",
  "Item.EMat.Low.Water.Desc": "Some dew droplets, collected from various plants. (Low-tier Water Material)",
  "Item.EMat.Low.Earth": "Dirt",
  "Item.EMat.Low.Earth.Desc": "Just your standard garden dirt. (Low-tier Earth Material)",
  "Item.EMat.Low.Wind": "Wind Feather",
  "Item.EMat.Low.Wind.Desc": "A feather enchanted with Wind magic. (Low-tier Wind Material)",
  "Item.EMat.Low.Star": "Stardust",
  "Item.EMat.Low.Star.Desc": "It's like house dust, but fancy and cosmic! (Low-tier Star Material)",
  "Item.EMat.Low.Void": "Void Essence",
  "Item.EMat.Low.Void.Desc": "The essence of the Void itself. It's darker than dark. (Low-tier Void Material)",
  "Item.EMat.Low.Elementless": "Alchemical Dust",
  "Item.EMat.Low.Elementless.Desc": "A dust used in alchemy to change elemental affinity. (Low-tier Elementless Material)",
  "Item.EMat.Low.Material": "Iron",
  "Item.EMat.Low.Material.Desc": "One of the most commonly used materials, its versitality is boosted even more when in a form of an alloy. (Low-tier Material Material)",
  "Item.EMat.Low.Magical": "Mana Sliver",
  "Item.EMat.Low.Magical.Desc": "A remnant of the Mana you used to cast Skills. (Low-tier Magical Material)",
  "Item.EMat.High.Physical": "Titanium",
  "Item.EMat.High.Physical.Desc": "It's not Adamantite, but it's still really good. (High-tier Physical Material)",
  "Item.EMat.High.Fire": "Basalt",
  "Item.EMat.High.Fire.Desc": "A large volcanic rock, that's still hot after the eruption. (High-tier Fire Material)",
  "Item.EMat.High.Ice": "Solid Water",
  "Item.EMat.High.Ice.Desc": "A form of water solidified under cold temperatures and high pressure. (High-tier Ice Material)",
  "Item.EMat.High.Electricity": "Bottled Lightning",
  "Item.EMat.High.Electricity.Desc": "Some lightning stuck in a Leyden jar. (High-tier Electrical Material)",
  "Item.EMat.High.Water": "Liquid Ice",
  "Item.EMat.High.Water.Desc": "A form of ice liquified under high temperatures and low pressure. (High-tier Water Material)",
  "Item.EMat.High.Earth": "Stone",
  "Item.EMat.High.Earth.Desc": "Better to not throw it - it would be a waste of a turn. (High-tier Earth Material)",
  "Item.EMat.High.Wind": "Gust Shard",
  "Item.EMat.High.Wind.Desc": "...how can you have a shard of something immaterial? (High-tier Wind Material)",
  "Item.EMat.High.Star": "Meteorite Shard",
  "Item.EMat.High.Star.Desc": "A shard of the very thing that assisted in dinocide. (High-tier Star Material)",
  "Item.EMat.High.Void": "Dark Matter",
  "Item.EMat.High.Void.Desc": "You're lucky it's not antimatter... (High-tier Void Material)",
  "Item.EMat.High.Elementless": "Energy Orb",
  "Item.EMat.High.Elementless.Desc": "A remnant of the Energy you used to cast Ultimates. (High-tier Elementless Material)",
  "Item.EMat.High.Material": "Platinum",
  "Item.EMat.High.Material.Desc": "Why it's associated with Diamond and Pearl, instead of Gold and Silver? (High-tier Material Material)",
  "Item.EMat.High.Magical": "Mana Silver",
  "Item.EMat.High.Magical.Desc": "Don't confuse it with the Mana Sliver. (High-tier Magical Material)",
  "Item.EMat.Gem.Physical": "Diamond",
  "Item.EMat.Gem.Physical.Desc": "Scientists and alchemists alike try to make them artifically to un-inflate their price. (Physical Gemstone)",
  "Item.EMat.Gem.Fire": "Ruby",
  "Item.EMat.Gem.Fire.Desc": "This gem definitely saw too much fire. (Fire Gemstone)",
  "Item.EMat.Gem.Ice": "Quartz",
  "Item.EMat.Gem.Ice.Desc": "It's mined in very hot places; how come it's related to ice?! (Ice Gemstone)",
  "Item.EMat.Gem.Electricity": "Amber",
  "Item.EMat.Gem.Electricity.Desc": "Organic gemstone-like material with electrostatic properties. (Electrical Gemstone)",
  "Item.EMat.Gem.Water": "Lazurite",
  "Item.EMat.Gem.Water.Desc": "Will you judge this thing if it's a gemstone or not? (Water Gemstone)",
  "Item.EMat.Gem.Earth": "Topaz",
  "Item.EMat.Gem.Earth.Desc": "Gemstone commonly found deep underground. (Earth Gemstone)",
  "Item.EMat.Gem.Wind": "Turquoise",
  "Item.EMat.Gem.Wind.Desc": "I don't think that there's a member of the Stonehearts named after this gemstone. (Wind Gemstone)",
  "Item.EMat.Gem.Star": "Opal",
  "Item.EMat.Gem.Star.Desc": "The second most colourful gemstone, right behind the Rainbow Crystal. (Star Gemstone)",
  "Item.EMat.Gem.Void": "Obsidian",
  "Item.EMat.Gem.Void.Desc": "Requires a diamond pickax- wait wrong game. (Void Gemstone)",
  "Item.EMat.Gem.Elementless": "Rainbow Crystal",
  "Item.EMat.Gem.Elementless.Desc": "Legends say that it's found at the end of a rainbow... but how there can be an end of an optical phenomenom? Unless... (Elementless Gemstone)",
  "Item.EMat.Gem.Material": "Jade",
  "Item.EMat.Gem.Material.Desc": "Commonly used for decoration, especially on the Archipelago. (Material Gemstone)",
  "Item.EMat.Gem.Magical": "Sapphire",
  "Item.EMat.Gem.Magical.Desc": "Despite being the most common in areas that have too much water, it isn't used for water-related crafts. (Magical Gemstone)",
  "Item.EMat.Alch.Physical": "Swordflower",
  "Item.EMat.Alch.Physical.Desc": "A very sharp plant that's a counterpart of the Shieldflower. (Physical Plant Material)",
  "Item.EMat.Alch.Fire": "Scorchweed",
  "Item.EMat.Alch.Fire.Desc": "One of the most invasive and dangerous plants, that's able to take over entire towns with a blazing blanket. (Fire Plant Material)",
  "Item.EMat.Alch.Ice": "Shivering Snowdrop",
  "Item.EMat.Alch.Ice.Desc": "Its erratic movements make it look like it's shivering from cold, which gave it its name. Ironically, it's cold to touch. (Ice Plant Material)",
  "Item.EMat.Alch.Electricity": "Electric Lily",
  "Item.EMat.Alch.Electricity.Desc": "A shockingly beautiful lily, that can take the interest of even the most snob-like wattanist. (Electrical Plant Material)",
  "Item.EMat.Alch.Water": "Sea Blossom",
  "Item.EMat.Alch.Water.Desc": "A favourite of Waterfolk - because it's a terrestial-like plant that can just as well grow deep underwater. (Water Plant Material)",
  "Item.EMat.Alch.Earth": "Stonemoss",
  "Item.EMat.Alch.Earth.Desc": "A variant of moss that can grow everywhere and has some stone-like properties. Apparently it also tastes good. (Earth Plant Material)",
  "Item.EMat.Alch.Wind": "Moonlit Dandelion",
  "Item.EMat.Alch.Wind.Desc": "A flower that has its seeds spread by wind, and that blooms especially well during a full moon. (Wind Plant Material)",
  "Item.EMat.Alch.Star": "Starbloom",
  "Item.EMat.Alch.Star.Desc": "It only blooms during starry night - which makes it increasingly uncommon near cities, due to light pollution. (Star Plant Material)",
  "Item.EMat.Alch.Void": "Nullthorn",
  "Item.EMat.Alch.Void.Desc": "...what is the purpose of these descriptions? And is this flower even real? (Void Plant Material)",
  "Item.EMat.Alch.Elementless": "Primordial Rose",
  "Item.EMat.Alch.Elementless.Desc": "The descendant of the very first rose that bloomed. (Elementless Plant Material)",
  "Item.EMat.Alch.Material": "Shieldflower",
  "Item.EMat.Alch.Material.Desc": "Having shield-like petals, it's a very nice counterpart of the Swordflower. (Material Plant Material)",
  "Item.EMat.Alch.Magical": "Manabloom",
  "Item.EMat.Alch.Magical.Desc": "It grows wherever there's a very large amount of magic usage, on which it feeds. (Magical Plant Material)",

  "Item.LMat.Forest.Low": "Forest Leaves",
  "Item.LMat.Forest.Low.Desc": "Don't worry, Forest will return soon. (Low-tier Forest of Elegy Material)",
  "Item.LMat.Forest.Mid": "Forest Wood",
  "Item.LMat.Forest.Mid.Desc": "It's hard to tell from which species of tree this wood was cut. (Mid-tier Forest of Elegy Material)",
  "Item.LMat.Forest.High": "Forest Water",
  "Item.LMat.Forest.High.Desc": "No need to worry about it reverting to normal water. (High-tier Forest of Elegy Material)",
  "Item.LMat.Forest.Alch": "Forest Weed",
  "Item.LMat.Forest.Alch.Desc": "It's useful for all sorts of purposes - medicine, alchemy, and even recreation. (Forest of Elegy Plant Material)",
  "Item.LMat.Volcano.Low": "Volcanic Ash",
  "Item.LMat.Volcano.Low.Desc": "Some ash from a recent eruption. Inhaling it isn't recommended. (Low-tier Volcano of Mercy Material)",
  "Item.LMat.Volcano.Mid": "Volcanic Debris",
  "Item.LMat.Volcano.Mid.Desc": "A large piece of whatever the volcano has blew up. (Mid-tier Volcano of Mercy Material)",
  "Item.LMat.Volcano.High": "Lava Bucket",
  "Item.LMat.Volcano.High.Desc": "The bucket is made out of tungsten, so it won't melt! (High-tier Volcano of Mercy Material)",
  "Item.LMat.Volcano.Alch": "Netherleaf",
  "Item.LMat.Volcano.Alch.Desc": "You can swear it came from an another, hellish dimension or something. (Volcano of Mercy Plant Material)",
  "Item.LMat.Desert.Low": "Crystal Sand",
  "Item.LMat.Desert.Low.Desc": "A bunch of sand that has been crystalized in an ice-like formation. (Low-tier Desert of Balance Material)",
  "Item.LMat.Desert.Mid": "Equilibrium Shard",
  "Item.LMat.Desert.Mid.Desc": "This thing is perfectly balanced, as all things should be. (Mid-tier Desert of Balance Material)",
  "Item.LMat.Desert.High": "Icestone",
  "Item.LMat.Desert.High.Desc": "Some ice that has been compressed into a sandstone-like rock. (High-tier Desert of Balance Material)",
  "Item.LMat.Desert.Alch": "Frost Cacti",
  "Item.LMat.Desert.Alch.Desc": "A cactus that needs so little water that it can be literally frozen and still thrive. (Desert of Balance Plant Material)",
  "Item.LMat.Island.Low": "Oni Piece",
  "Item.LMat.Island.Low.Desc": "There's more than one. (Low-tier Islands of Eternity Material)",
  "Item.LMat.Island.Mid": "Moon Bamboo",
  "Item.LMat.Island.Mid.Desc": "It's glowing, so it probably has a princess inside! (Mid-tier Islands of Eternity Material)",
  "Item.LMat.Island.High": "Miracle Ore",
  "Item.LMat.Island.High.Desc": "It has negative mass, allowing these islands to fly in midair. Just make sure that you are weighting it with something when storing it. (High-tier Islands of Eternity Material)",
  "Item.LMat.Island.Alch": "Chrysanthemums of Time",
  "Item.LMat.Island.Alch.Desc": "It blooms day-and-night for thousands of years, seemingly not caring the slightest about the passage of time. (Islands of Eternity Plant Material)",
  "Item.LMat.Castle.Low": "Bad End String",
  "Item.LMat.Castle.Low.Desc": "A purple string that has ended many... (Low-tier Castle of Retaliation Material)",
  "Item.LMat.Castle.Mid": "Dystopian Slab",
  "Item.LMat.Castle.Mid.Desc": "A black, reflective slab of metal and glass that allows you to do many things, both good and horrible. (Mid-tier Castle of Retaliation Material)",
  "Item.LMat.Castle.High": "Deja-vu Plush",
  "Item.LMat.Castle.High.Desc": "It looks ucanningly familiar... (High-tier Castle of Retaliation Material)",
  "Item.LMat.Castle.Alch": "Red Spider Lily",
  "Item.LMat.Castle.Alch.Desc": "Don't place these in a boquet. (Castle of Retaliation Plant Material)",

  "Item.Key.Newspaper": "Newspaper",
  "Item.Key.Newspaper.Desc": "\"KillerBots continue their rampage! More info on Page 5!\"",
  "Item.Key.Boots.Beam": "Ninja Boots",
  "Item.Key.Boots.Beam.Desc": "Allows you to walk on thin beams without having to worry about falling off.",
  "Item.Key.Tool.Axe": "The Axe",
  "Item.Key.Tool.Axe.Desc": "Allows you to chop down wooden barricades.",
  "Item.Key.Boots.Platform": "The Platform",
  "Item.Key.Boots.Platform.Desc": "Allows you to walk over 1-tile gaps. Way safer than a stepladder.",
  "Item.Key.Tool.Pick": "The Pickaxe",
  "Item.Key.Tool.Pick.Desc": "Allows you to mine rubble blockades.",
  "Item.Key.Boots.Lilypad": "Water-walking Boots",
  "Item.Key.Boots.Lilypad.Desc": "Allows you to walk on lilypads without having to worry about falling into water.",
  "Item.Key.Tool.Candle": "The Candle",
  "Item.Key.Tool.Candle.Desc": "Allows you to light braziers for puzzle purposes.",
  "Item.Key.Tool.Shovel": "The Shovel",
  "Item.Key.Tool.Shovel.Desc": "Allows you to dig up dirt mounds.",
  "Item.Key.Boots.Acid": "Acid-proof Boots",
  "Item.Key.Boots.Acid.Desc": "Allows you to walk on acid. That'll still hurt though.",
  "Item.Key.Tool.Hammer": "The Hammer",
  "Item.Key.Tool.Hammer.Desc": "Allows you to shatter crystals.",
  "Item.Key.Boots.Card": "ID Card",
  "Item.Key.Boots.Card.Desc": "Allows you to pass through locked doors. You stole someone's identity THIS easily.",
  "Item.Key.Tool.Laser": "The Laser",
  "Item.Key.Tool.Laser.Desc": "Allows you to destroy weak walls.",
  "Item.Key.Key.Bronze": "Bronze Key",
  "Item.Key.Key.Bronze.Desc": "A simple key made out of bronze. Can be used to open bronze blockades across the world.",
  "Item.Key.Key.Silver": "Silver Key",
  "Item.Key.Key.Silver.Desc": "A key with antibacterial and antimagical properties. Can be used to open silver blockades across the world.",
  "Item.Key.Key.Golden": "Golden Key",
  "Item.Key.Key.Golden.Desc": "It's not any bigger than any other keys, yet it's so heavy. Can be used to open golden blockades across the world.",
  "Item.Key.Key.Platinum": "Platinum Key",
  "Item.Key.Key.Platinum.Desc": "The rarest of all the keys, yet it looks so similar to the Silver Key. Can be used to open platinum blockades across the world.",
  "Item.Key.Key.Steel": "Steel Key",
  "Item.Key.Key.Steel.Desc": "A modern key that looks like it could be used for opening a door. Can be used to open steel blockades in Ark City.",
  "Item.Key.Key.Ancient": "Ancient Key",
  "Item.Key.Key.Ancient.Desc": "A relic used as a consumable. Can be used to open ancient blockades in Kastellia Ruins.",
  "Item.Key.Key.Wooden": "Wooden Key",
  "Item.Key.Key.Wooden.Desc": "A key made out of a chunk of wood. Can be used to open wooden blockades in the Polluted Forest.",
  "Item.Key.Key.Acid": "Acid Key",
  "Item.Key.Key.Acid.Desc": "A key made out of an incredibly acidic half-solid half-liquid material. Can be used to open acid blockades in the KillerBot Factory.",
  "Item.Key.Key.Skeleton": "Skeleton Key",
  "Item.Key.Key.Skeleton.Desc": "Sadly it only goes into one of the locks. Can be used to open skeleton blockades in Spleefium Inc.."
}